from odoo import fields, models


class Partner(models.Model):
    _inherit = 'res.partner'

    is_company = fields.Boolean(string='Is a Company', default=True,
                                help="Check if the contact is a company, otherwise it is a person")

    reference = fields.Selection([
        ('agent_service_partner', '代理商服务伙伴'),
        ('salesman_get', '业务员直接获取'),
        ('marketing', '全名营销'),
        ('second_marketing', '售后二次营销'),
        ('internet_channel', '互联网渠道'),
    ], string='来源')

    industry = fields.Selection([
        ('production', '生产制造类'),
        ('transportation', '交通运输类(城轨、铁路、机场、航空、其他)'),
        ('petrochemical', '石油化工类（燃气、石油石化、其他）'),
        ('financial', '金融证券'),
        ('service', '服务业'),
        ('other', '其他'),
    ], string='所属行业')

    scale = fields.Selection([
        ('<50', '50人以下人'),
        ('50-100', '50 ~ 100人'),
        ('100-500', '100 ~ 500人'),
        ('500-1000', '500 ~ 1000人'),
        ('>1000', '1000人以上'),
    ], string='企业规模')

    information = fields.Text(string='企业决策链', help='请输入决策链')

    wechat = fields.Char(string='微信号')
    qq = fields.Char(string='QQ号')
    department = fields.Selection([
        ('hr', '人力资源部'),
        ('it', '信息IT部'),
        ('bloc', '集团'),
        ('lower_level_unit', '下属单位'),
        ('other', '其他'),
    ], string='所属部门')
    higher_level_unit = fields.Char(string='上级单位')

    area_code = fields.Selection(
        [('93', '阿富汗+93'), ('9888', '尼尔+9888'), ('355', '阿尔巴尼亚+355'), ('213', '阿尔及利亚+213'), ('376', '安道尔+376'),
         ('244', '安哥拉+244'), ('1264', '安圭拉岛+1264'), ('1268', '安提瓜和巴布达+1268'), ('54', '阿根廷+54'), ('374', '亚美尼亚+374'),
         ('61', '澳大利亚+61'), ('43', '奥地利+43'), ('994', '阿塞拜疆+994'), ('1242', '巴哈马+1242'), ('973', '巴林+973'),
         ('880', '孟加拉国+880'),
         ('1246', '巴巴多斯+1246'), ('375', '白俄罗斯+375'), ('32', '比利时+32'), ('501', '伯利兹+501'), ('229', '贝宁+229'),
         ('1441', '百慕大群岛+1441'), ('591', '玻利维亚+591'), ('267', '博茨瓦纳+267'), ('55', '巴西+55'), ('673', '文莱+673'),
         ('359', '保加利亚+359'), ('226', '布基纳法索+226'), ('257', '布隆迪+257'), ('855', '柬埔寨+855'), ('237', '喀麦隆+237'),
         ('1', '加拿大+1'),
         ('1345', '开曼群岛+1345'), ('236', '中非共和国+236'), ('235', '乍得+235'), ('56', '智利+56'), ('86', '中国+86'),
         ('57', '哥伦比亚+57'),
         ('242', '刚果+242'), ('682', '库克群岛+682'), ('506', '哥斯达黎加+506'), ('225', '科特迪瓦+225'), ('53', '古巴+53'),
         ('357', '塞浦路斯+357'), ('420', '捷克共和国+420'), ('45', '丹麦+45'), ('253', '吉布提+253'), ('1890', '多米尼加共和国+1890'),
         ('593', '厄瓜多尔+593'), ('20', '埃及+20'), ('503', '萨尔瓦多+503'), ('372', '爱沙尼亚+372'), ('251', '埃塞俄比亚+251'),
         ('679', '斐济群岛+679'), ('358', '芬兰+358'), ('33', '法国+33'), ('594', '法属圭亚那+594'), ('689', '法属波利尼西亚+689'),
         ('241', '加蓬+241'), ('220', '冈比亚+220'), ('995', '乔治亚+995'), ('49', '德国+49'), ('233', '加纳+233'),
         ('350', '直布罗陀+350'),
         ('30', '希腊+30'), ('1809', '格林纳达+1809'), ('1671', '关岛+1671'), ('502', '危地马拉+502'), ('224', '几内亚+224'),
         ('592', '圭亚那+592'), ('509', '海地+509'), ('504', '洪都拉斯+504'), ('852', '中国香港+852'), ('36', '匈牙利+36'),
         ('354', '冰岛+354'),
         ('91', '印度+91'), ('62', '印度尼西亚+62'), ('98', '伊朗+98'), ('964', '伊拉克+964'), ('353', '爱尔兰+353'),
         ('972', '以色列+972'),
         ('39', '意大利+39'), ('1876', '牙买加+1876'), ('81', '日本+81'), ('962', '约旦+962'), ('327', '哈萨克斯坦+327'),
         ('254', '肯尼亚+254'),
         ('850', '朝鲜+850'), ('82', '韩国+82'), ('965', '科威特+965'), ('331', '吉尔吉斯斯坦+331'), ('856', '老挝+856'),
         ('371', '拉脱维亚+371'),
         ('961', '黎巴嫩+961'), ('266', '莱索托+266'), ('231', '利比里亚+231'), ('218', '利比亚+218'), ('423', '列支敦士登+423'),
         ('370', '立陶宛+370'), ('352', '卢森堡+352'), ('853', '中国澳门+853'), ('261', '马达加斯加+261'), ('265', '马拉维+265'),
         ('60', '马来西亚+60'), ('960', '马尔代夫+960'), ('223', '马里+223'), ('356', '马耳他+356'), ('596', '马提尼克岛+596'),
         ('230', '毛里求斯+230'), ('52', '墨西哥+52'), ('373', '摩尔多瓦+373'), ('377', '摩纳哥+377'), ('976', '蒙古+976'),
         ('1664', '蒙特塞拉特+1664'), ('212', '摩洛哥+212'), ('258', '莫桑比克+258'), ('95', '缅甸+95'), ('264', '纳米比亚+264'),
         ('674', '瑙鲁+674'), ('977', '尼泊尔+977'), ('31', '荷兰+31'), ('599', '荷属安的列斯群岛+599'), ('64', '新西兰+64'),
         ('505', '尼加拉瓜+505'),
         ('227', '尼日尔+227'), ('234', '尼日利亚+234'), ('47', '挪威+47'), ('968', '阿曼+968'), ('92', '巴基斯坦+92'),
         ('507', '巴拿马+507'),
         ('675', '巴布亚新几内亚+675'), ('595', '巴拉圭+595'), ('51', '秘鲁+51'), ('63', '菲律宾+63'), ('48', '波兰+48'),
         ('351', '葡萄牙+351'),
         ('1787', '波多黎各+1787'), ('974', '卡塔尔+974'), ('262', '留尼汪岛+262'), ('40', '罗马尼亚+40'), ('7', '俄罗斯+7'),
         ('1758', '圣卢西亚+1758'), ('1784', '圣文森特和格林纳丁斯+1784'), ('685', '萨摩亚+685'), ('378', '圣马力诺+378'),
         ('239', '圣多美和普林西比+239'),
         ('966', '沙特阿拉伯+966'), ('221', '塞内加尔+221'), ('248', '塞舌尔+248'), ('232', '塞拉利昂+232'), ('65', '新加坡+65'),
         ('421', '斯洛伐克+421'), ('386', '斯洛文尼亚+386'), ('677', '所罗门群岛+677'), ('252', '索马里+252'), ('27', '南非+27'),
         ('34', '西班牙+34'),
         ('94', '斯里兰卡+94'), ('249', '苏丹+249'), ('597', '苏里南+597'), ('268', '斯威士兰+268'), ('46', '瑞典+46'),
         ('41', '瑞士+41'),
         ('963', '叙利亚+963'), ('886', '中国台湾+886'), ('992', '塔吉克斯坦+992'), ('255', '坦桑尼亚+255'), ('66', '泰国+66'),
         ('228', '多哥+228'),
         ('676', '汤加+676'), ('1809', '特立尼达和多巴哥+1809'), ('216', '突尼斯+216'), ('90', '土耳其+90'), ('993', '土库曼斯坦+993'),
         ('256', '乌干达+256'), ('380', '乌克兰+380'), ('971', '阿拉伯联合酋长国+971'), ('44', '英国+44'), ('1', '美国+1'),
         ('684', '美属萨摩亚+684'),
         ('598', '乌拉圭+598'), ('233', '乌兹别克斯坦+233'), ('58', '委内瑞拉+58'), ('84', '越南+84'), ('967', '也门+967'),
         ('260', '赞比亚+260'),
         ('263', '津巴布韦+263')], string='手机区号', default='86')


